/**
ГАРЯЧІ КЛАВІШИ

 command + option + A / ctr + alt + A - активуємо файл щоб читав GitHub
 command + K - добавляэмо коміт -> Commit und Push


 command + D - дублювання рядка...
fori - for
iter - foreach
/** + enter - і створюється коментар із параметрами


_________________________////_____________________________

 Целочисленные типы: byte, short, int, long
Вещественные типы (с плавающей точкой): float, double
Символьный тип: char
Логический тип: boolean

 */


/**
 * Навіщо взагалі equals і hashCode
 * equals(Object) відповідає на запитання: чи є два об’єкти логічно однаковими?
 * hashCode() повертає ціле число (хеш), яке колекції типу HashSet/HashMap використовують для швидкого пошуку.
 */