/**
 * 📋 Задание 1 (обязательное): Создание и базовые операции с ArrayList
 * Сложность: ⭐
 * <p>
 * Описание:
 * Создайте программу для управления списком студентов в группе.
 * <p>
 * Требования:
 * Создайте ArrayList для хранения имен студентов
 * Добавьте 5 студентов в список
 * Выведите общее количество студентов
 * Выведите имя первого и последнего студента
 * Проверьте, есть ли в списке студент с именем "Анна"
 * Выведите весь список студентов
 * Ожидаемый результат:
 * Количество студентов: 5
 * Первый студент: [имя]
 * Последний студент: [имя]
 * Студент Анна найден: true/false
 * Список всех студентов: [список]
 * Copy
 * 📋 Задание 2 (для желающих): Работа с методами поиска и удаления
 * Сложность: ⭐⭐
 * <p>
 * Описание:
 * Создайте программу для управления списком покупок с возможностью поиска и удаления товаров.
 * <p>
 * Требования:
 * Создайте ArrayList с начальным списком из 7 товаров
 * Найдите индекс товара "молоко" (если есть)
 * Удалите товар по индексу 2
 * Удалите товар "хлеб" по названию (если есть)
 * Добавьте новый товар "сыр" на позицию 1
 * Замените товар на позиции 0 на "масло"
 * Выведите финальный список покупок
 * Дополнительно:
 * Обработайте случаи, когда товар не найден
 * Покажите размер списка до и после операций
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("123");

    }
}

