public class Main2 {
    public static void main(String[] args) {
        String str1 = "Vasya", str2 = "Ivan";
        String result = str1 + " " + str2 + "!";
        System.out.println(result);

        double d1 = 0.1, d2 = 0.2;
        System.out.println("d1=" + d1 + "d2=" + d2 + "summa=" + (d1 + d2));
    }
}

/*
Создайте новый класс с методом main.
## Задание 1
Создайте 3 переменные:

- Адрес здания
- Количество этажей
- Количество проживающий людей.

Выведите переменные в консоль, чтобы получилась
фраза по образцу: Адрес, сколько этажей, сколько человек.

Пример:
~~~
ул. Горького 18, 7 этажей, 120 человек.
~~~

Обратите внимание на то, как именовать переменные
и какой тип данных они имеют

## Задание 2

Создайте новый класс.
Создайте переменную, которая содержит цену товара без налога.
Создайте переменную, которая содержит сколько процентов, составляет налог.
Ваша программа должна рассчитать и вывести на экран цену товара с налогом.

Например:
цена 100 евро, налог 19 процентов
стоимость с налогом: 119 евро

 */
